; domain
(define (domain emergency-carrier)
    (:requirements :strips :typing :action-costs)

    (:types
        drone person crate location content carrier num
    )

    (:predicates
        ;; Localización
        (at-drone ?d - drone ?l - location)
        (at-person ?p - person ?l - location)
        (at-crate ?c - crate ?l - location)
        (at-carrier ?ca - carrier ?l - location)

        ;; Estado del dron
        (holding ?d - drone ?c - crate)
        (drone-free ?d - drone)

        ;; Transportador
        (carrying ?d - drone ?ca - carrier)

        ;; Contenido
        (crate-has ?c - crate ?t - content)
        (person-has ?p - person ?t - content)

        ;; Cajas dentro del transportador
        (in ?c - crate ?ca - carrier)

        ;; Control numérico
        (carrier-load ?ca - carrier ?n - num)
        (carrier-capacity ?ca - carrier ?n - num)
        (siguiente ?n1 ?n2 - num)
    )

    (:functions
        (total-cost)
        (fly-cost ?from - location ?to - location)
    )

    ;; -----------------------------
    ;; COGER TRANSPORTADOR
    ;; -----------------------------
    (:action pick-up-carrier
        :parameters (?d - drone ?ca - carrier ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (at-carrier ?ca ?l)
        )
        :effect (and
            (not (at-carrier ?ca ?l))
            (carrying ?d ?ca)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; DEJAR TRANSPORTADOR
    ;; -----------------------------
    (:action drop-carrier
        :parameters (?d - drone ?ca - carrier ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
        )
        :effect (and
            (not (carrying ?d ?ca))
            (at-carrier ?ca ?l)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; MOVER SOLO DRON (coste variable)
    ;; -----------------------------
    (:action fly
        :parameters (?d - drone ?from - location ?to - location)
        :precondition (at-drone ?d ?from)
        :effect (and
            (not (at-drone ?d ?from))
            (at-drone ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )

    ;; -----------------------------
    ;; VOLAR CON TRANSPORTADOR (coste variable)
    ;; -----------------------------
    (:action fly-and-move-carrier
        :parameters (?d - drone ?ca - carrier ?from - location ?to - location)
        :precondition (and
            (at-drone ?d ?from)
            (carrying ?d ?ca)
        )
        :effect (and
            (not (at-drone ?d ?from))
            (at-drone ?d ?to)
            (increase (total-cost) (fly-cost ?from ?to))
        )
    )

    ;; -----------------------------
    ;; COGER CAJA
    ;; -----------------------------
    (:action pick-up
        :parameters (?d - drone ?c - crate ?l - location)
        :precondition (and
            (at-drone ?d ?l)
            (at-crate ?c ?l)
            (drone-free ?d)
        )
        :effect (and
            (not (at-crate ?c ?l))
            (not (drone-free ?d))
            (holding ?d ?c)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; PONER CAJA EN TRANSPORTADOR
    ;; -----------------------------
    (:action put-in-carrier
        :parameters (?d - drone ?c - crate ?ca - carrier ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
            (holding ?d ?c)
            (carrier-load ?ca ?n1)
            (carrier-capacity ?ca ?n2)
            (siguiente ?n1 ?n2)
        )
        :effect (and
            (not (holding ?d ?c))
            (drone-free ?d)
            (in ?c ?ca)
            (not (carrier-load ?ca ?n1))
            (carrier-load ?ca ?n2)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; SACAR CAJA DEL TRANSPORTADOR
    ;; -----------------------------
    (:action take-from-carrier
        :parameters (?d - drone ?c - crate ?ca - carrier ?l - location ?n1 ?n2 - num)
        :precondition (and
            (at-drone ?d ?l)
            (carrying ?d ?ca)
            (in ?c ?ca)
            (carrier-load ?ca ?n2)
            (siguiente ?n1 ?n2)
            (drone-free ?d)
        )
        :effect (and
            (holding ?d ?c)
            (not (drone-free ?d))
            (not (in ?c ?ca))
            (not (carrier-load ?ca ?n2))
            (carrier-load ?ca ?n1)
            (increase (total-cost) 1)
        )
    )

    ;; -----------------------------
    ;; ENTREGAR
    ;; -----------------------------
    (:action deliver
        :parameters (?d - drone ?c - crate ?p - person ?l - location ?t - content)
        :precondition (and
            (at-drone ?d ?l)
            (holding ?d ?c)
            (at-person ?p ?l)
            (crate-has ?c ?t)
        )
        :effect (and
            (person-has ?p ?t)
            (not (holding ?d ?c))
            (drone-free ?d)
            (increase (total-cost) 1)
        )
    )
)

; problem
(define (problem emergency_carrier_d1_r1_l10_p10_c10_g10)
(:domain emergency-carrier)
(:objects
	drone1 - drone
	carrier1 - carrier
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	n0 - num
	n1 - num
	n2 - num
	n3 - num
	n4 - num
)
(:init
	(= (total-cost) 0)
	(= (fly-cost depot depot) 0)
	(= (fly-cost depot loc1) 190)
	(= (fly-cost depot loc2) 225)
	(= (fly-cost depot loc3) 144)
	(= (fly-cost depot loc4) 76)
	(= (fly-cost depot loc5) 123)
	(= (fly-cost depot loc6) 80)
	(= (fly-cost depot loc7) 229)
	(= (fly-cost depot loc8) 203)
	(= (fly-cost depot loc9) 161)
	(= (fly-cost depot loc10) 236)
	(= (fly-cost loc1 depot) 190)
	(= (fly-cost loc1 loc1) 0)
	(= (fly-cost loc1 loc2) 60)
	(= (fly-cost loc1 loc3) 117)
	(= (fly-cost loc1 loc4) 128)
	(= (fly-cost loc1 loc5) 84)
	(= (fly-cost loc1 loc6) 145)
	(= (fly-cost loc1 loc7) 123)
	(= (fly-cost loc1 loc8) 131)
	(= (fly-cost loc1 loc9) 40)
	(= (fly-cost loc1 loc10) 78)
	(= (fly-cost loc2 depot) 225)
	(= (fly-cost loc2 loc1) 60)
	(= (fly-cost loc2 loc2) 0)
	(= (fly-cost loc2 loc3) 111)
	(= (fly-cost loc2 loc4) 152)
	(= (fly-cost loc2 loc5) 139)
	(= (fly-cost loc2 loc6) 161)
	(= (fly-cost loc2 loc7) 75)
	(= (fly-cost loc2 loc8) 96)
	(= (fly-cost loc2 loc9) 99)
	(= (fly-cost loc2 loc10) 18)
	(= (fly-cost loc3 depot) 144)
	(= (fly-cost loc3 loc1) 117)
	(= (fly-cost loc3 loc2) 111)
	(= (fly-cost loc3 loc3) 0)
	(= (fly-cost loc3 loc4) 70)
	(= (fly-cost loc3 loc5) 130)
	(= (fly-cost loc3 loc6) 65)
	(= (fly-cost loc3 loc7) 86)
	(= (fly-cost loc3 loc8) 58)
	(= (fly-cost loc3 loc9) 124)
	(= (fly-cost loc3 loc10) 113)
	(= (fly-cost loc4 depot) 76)
	(= (fly-cost loc4 loc1) 128)
	(= (fly-cost loc4 loc2) 152)
	(= (fly-cost loc4 loc3) 70)
	(= (fly-cost loc4 loc4) 0)
	(= (fly-cost loc4 loc5) 91)
	(= (fly-cost loc4 loc6) 22)
	(= (fly-cost loc4 loc7) 152)
	(= (fly-cost loc4 loc8) 128)
	(= (fly-cost loc4 loc9) 111)
	(= (fly-cost loc4 loc10) 161)
	(= (fly-cost loc5 depot) 123)
	(= (fly-cost loc5 loc1) 84)
	(= (fly-cost loc5 loc2) 139)
	(= (fly-cost loc5 loc3) 130)
	(= (fly-cost loc5 loc4) 91)
	(= (fly-cost loc5 loc5) 0)
	(= (fly-cost loc5 loc6) 114)
	(= (fly-cost loc5 loc7) 181)
	(= (fly-cost loc5 loc8) 173)
	(= (fly-cost loc5 loc9) 45)
	(= (fly-cost loc5 loc10) 155)
	(= (fly-cost loc6 depot) 80)
	(= (fly-cost loc6 loc1) 145)
	(= (fly-cost loc6 loc2) 161)
	(= (fly-cost loc6 loc3) 65)
	(= (fly-cost loc6 loc4) 22)
	(= (fly-cost loc6 loc5) 114)
	(= (fly-cost loc6 loc6) 0)
	(= (fly-cost loc6 loc7) 151)
	(= (fly-cost loc6 loc8) 123)
	(= (fly-cost loc6 loc9) 132)
	(= (fly-cost loc6 loc10) 169)
	(= (fly-cost loc7 depot) 229)
	(= (fly-cost loc7 loc1) 123)
	(= (fly-cost loc7 loc2) 75)
	(= (fly-cost loc7 loc3) 86)
	(= (fly-cost loc7 loc4) 152)
	(= (fly-cost loc7 loc5) 181)
	(= (fly-cost loc7 loc6) 151)
	(= (fly-cost loc7 loc7) 0)
	(= (fly-cost loc7 loc8) 35)
	(= (fly-cost loc7 loc9) 153)
	(= (fly-cost loc7 loc10) 62)
	(= (fly-cost loc8 depot) 203)
	(= (fly-cost loc8 loc1) 131)
	(= (fly-cost loc8 loc2) 96)
	(= (fly-cost loc8 loc3) 58)
	(= (fly-cost loc8 loc4) 128)
	(= (fly-cost loc8 loc5) 173)
	(= (fly-cost loc8 loc6) 123)
	(= (fly-cost loc8 loc7) 35)
	(= (fly-cost loc8 loc8) 0)
	(= (fly-cost loc8 loc9) 154)
	(= (fly-cost loc8 loc10) 88)
	(= (fly-cost loc9 depot) 161)
	(= (fly-cost loc9 loc1) 40)
	(= (fly-cost loc9 loc2) 99)
	(= (fly-cost loc9 loc3) 124)
	(= (fly-cost loc9 loc4) 111)
	(= (fly-cost loc9 loc5) 45)
	(= (fly-cost loc9 loc6) 132)
	(= (fly-cost loc9 loc7) 153)
	(= (fly-cost loc9 loc8) 154)
	(= (fly-cost loc9 loc9) 0)
	(= (fly-cost loc9 loc10) 116)
	(= (fly-cost loc10 depot) 236)
	(= (fly-cost loc10 loc1) 78)
	(= (fly-cost loc10 loc2) 18)
	(= (fly-cost loc10 loc3) 113)
	(= (fly-cost loc10 loc4) 161)
	(= (fly-cost loc10 loc5) 155)
	(= (fly-cost loc10 loc6) 169)
	(= (fly-cost loc10 loc7) 62)
	(= (fly-cost loc10 loc8) 88)
	(= (fly-cost loc10 loc9) 116)
	(= (fly-cost loc10 loc10) 0)
	(at-drone drone1 depot)
	(drone-free drone1)
	(at-carrier carrier1 depot)
	(carrier-load carrier1 n0)
	(carrier-capacity carrier1 n4)
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(at-crate crate6 depot)
	(at-crate crate7 depot)
	(at-crate crate8 depot)
	(at-crate crate9 depot)
	(at-crate crate10 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 food)
	(crate-has crate4 food)
	(crate-has crate5 food)
	(crate-has crate6 food)
	(crate-has crate7 food)
	(crate-has crate8 medicine)
	(crate-has crate9 medicine)
	(crate-has crate10 medicine)
	(at-person person1 loc7)
	(at-person person2 loc10)
	(at-person person3 loc1)
	(at-person person4 loc3)
	(at-person person5 loc5)
	(at-person person6 loc1)
	(at-person person7 loc8)
	(at-person person8 loc3)
	(at-person person9 loc1)
	(at-person person10 loc6)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person4 food)
	(person-has person4 medicine)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person8 medicine)
	(person-has person9 food)
	(person-has person10 food)
	(person-has person10 medicine)
))
(:metric minimize (total-cost))
)

; plan
1. (pick-up drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (drone-free drone1)
   added: (holding drone1 crate5)
   goals met: 1 of 11
2. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 0 of 11
3. (deliver drone1 crate5 person9 loc1 food)
   deleted: (holding drone1 crate5)
   added: (person-has person9 food) (drone-free drone1)
   goals met: 1 of 11
4. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 2 of 11
5. (pick-up drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (drone-free drone1)
   added: (holding drone1 crate4)
   goals met: 2 of 11
6. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 1 of 11
7. (deliver drone1 crate4 person1 loc7 food)
   deleted: (holding drone1 crate4)
   added: (person-has person1 food) (drone-free drone1)
   goals met: 2 of 11
8. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 3 of 11
9. (pick-up drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (drone-free drone1)
   added: (holding drone1 crate2)
   goals met: 3 of 11
10. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 2 of 11
11. (fly drone1 loc3 loc8)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 loc8)
   goals met: 2 of 11
12. (deliver drone1 crate2 person7 loc8 food)
   deleted: (holding drone1 crate2)
   added: (person-has person7 food) (drone-free drone1)
   goals met: 3 of 11
13. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 4 of 11
14. (pick-up drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (drone-free drone1)
   added: (holding drone1 crate7)
   goals met: 4 of 11
15. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 3 of 11
16. (deliver drone1 crate7 person4 loc3 food)
   deleted: (holding drone1 crate7)
   added: (person-has person4 food) (drone-free drone1)
   goals met: 4 of 11
17. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 5 of 11
18. (pick-up drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (drone-free drone1)
   added: (holding drone1 crate3)
   goals met: 5 of 11
19. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 4 of 11
20. (deliver drone1 crate3 person8 loc3 food)
   deleted: (holding drone1 crate3)
   added: (person-has person8 food) (drone-free drone1)
   goals met: 5 of 11
21. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 6 of 11
22. (pick-up drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (drone-free drone1)
   added: (holding drone1 crate8)
   goals met: 6 of 11
23. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 5 of 11
24. (deliver drone1 crate8 person4 loc3 medicine)
   deleted: (holding drone1 crate8)
   added: (person-has person4 medicine) (drone-free drone1)
   goals met: 6 of 11
25. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 7 of 11
26. (pick-up drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (drone-free drone1)
   added: (holding drone1 crate9)
   goals met: 7 of 11
27. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 6 of 11
28. (deliver drone1 crate9 person8 loc3 medicine)
   deleted: (holding drone1 crate9)
   added: (person-has person8 medicine) (drone-free drone1)
   goals met: 7 of 11
29. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 8 of 11
30. (pick-up drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (drone-free drone1)
   added: (holding drone1 crate6)
   goals met: 8 of 11
31. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 7 of 11
32. (deliver drone1 crate6 person2 loc10 food)
   deleted: (holding drone1 crate6)
   added: (person-has person2 food) (drone-free drone1)
   goals met: 8 of 11
33. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 9 of 11
34. (pick-up drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (drone-free drone1)
   added: (holding drone1 crate10)
   goals met: 9 of 11
35. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 8 of 11
36. (deliver drone1 crate10 person10 loc6 medicine)
   deleted: (holding drone1 crate10)
   added: (person-has person10 medicine) (drone-free drone1)
   goals met: 9 of 11
37. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 10 of 11
38. (pick-up drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (drone-free drone1)
   added: (holding drone1 crate1)
   goals met: 10 of 11
39. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 9 of 11
40. (deliver drone1 crate1 person10 loc6 food)
   deleted: (holding drone1 crate1)
   added: (person-has person10 food) (drone-free drone1)
   goals met: 10 of 11
41. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 11 of 11
